{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(assignments(),scheduledActionsForRule(scheduledActionConfigurations()))/$entity",
  "@odata.type": "#microsoft.graph.androidWorkProfileCompliancePolicy",
  "@odata.id": "deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')",
  "@odata.editLink": "deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/microsoft.graph.androidWorkProfileCompliancePolicy",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "6b870eff-71ba-4dca-bbd8-006d9267cea2",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2026-01-12T10:01:53.6547866Z",
  "description": "This compliance policy applies to Android Enterprise BYOD Personally-Owned Work-Profile users.",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2026-04-22T16:06:17.8509062Z",
  "displayName": "AND - Compliance - USR - Personally-Owned - Work-Profile",
  "version": 24,
  "passwordRequired": true,
  "passwordMinimumLength": null,
  "passwordRequiredType@odata.type": "#microsoft.graph.androidRequiredPasswordType",
  "passwordRequiredType": "deviceDefault",
  "requiredPasswordComplexity@odata.type": "#microsoft.graph.androidRequiredPasswordComplexity",
  "requiredPasswordComplexity": "medium",
  "passwordMinutesOfInactivityBeforeLock": 15,
  "passwordExpirationDays": 365,
  "passwordPreviousPasswordBlockCount": 5,
  "passwordSignInFailureCountBeforeFactoryReset": null,
  "workProfilePasswordExpirationInDays": null,
  "workProfilePasswordMinimumLength": null,
  "workProfileInactiveBeforeScreenLockInMinutes": null,
  "workProfilePreviousPasswordBlockCount": null,
  "workProfilePasswordRequiredType@odata.type": "#microsoft.graph.androidWorkProfileRequiredPasswordType",
  "workProfilePasswordRequiredType": "deviceDefault",
  "workProfileRequiredPasswordComplexity@odata.type": "#microsoft.graph.androidRequiredPasswordComplexity",
  "workProfileRequiredPasswordComplexity": "medium",
  "workProfileRequirePassword": true,
  "securityPreventInstallAppsFromUnknownSources": false,
  "securityDisableUsbDebugging": true,
  "securityRequireVerifyApps": false,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "advancedThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
  "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
  "securityBlockJailbrokenDevices": true,
  "osMinimumVersion": "13.0",
  "osMaximumVersion": null,
  "minAndroidSecurityPatchLevel": null,
  "storageRequireEncryption": true,
  "securityRequireSafetyNetAttestationBasicIntegrity": true,
  "securityRequireSafetyNetAttestationCertifiedDevice": false,
  "securityRequireGooglePlayServices": true,
  "securityRequireUpToDateSecurityProviders": true,
  "securityRequireCompanyPortalAppIntegrity": true,
  "securityRequiredAndroidSafetyNetEvaluationType@odata.type": "#microsoft.graph.androidSafetyNetEvaluationType",
  "securityRequiredAndroidSafetyNetEvaluationType": "basic",
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/microsoft.graph.androidWorkProfileCompliancePolicy/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/microsoft.graph.androidWorkProfileCompliancePolicy/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/microsoft.graph.androidWorkProfileCompliancePolicy/assignments",
  "scheduledActionsForRule@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/microsoft.graph.androidWorkProfileCompliancePolicy/scheduledActionsForRule(scheduledActionConfigurations())",
  "scheduledActionsForRule@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/microsoft.graph.androidWorkProfileCompliancePolicy/scheduledActionsForRule/$ref",
  "scheduledActionsForRule@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/microsoft.graph.androidWorkProfileCompliancePolicy/scheduledActionsForRule",
  "scheduledActionsForRule": [
    {
      "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
      "@odata.id": "deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/scheduledActionsForRule('6b870eff-71ba-4dca-bbd8-006d9267cea2')",
      "@odata.editLink": "deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/scheduledActionsForRule('6b870eff-71ba-4dca-bbd8-006d9267cea2')",
      "id": "6b870eff-71ba-4dca-bbd8-006d9267cea2",
      "ruleName": null,
      "scheduledActionConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/microsoft.graph.androidWorkProfileCompliancePolicy/scheduledActionsForRule('6b870eff-71ba-4dca-bbd8-006d9267cea2')/scheduledActionConfigurations",
      "scheduledActionConfigurations@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/scheduledActionsForRule('6b870eff-71ba-4dca-bbd8-006d9267cea2')/scheduledActionConfigurations/$ref",
      "scheduledActionConfigurations@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/scheduledActionsForRule('6b870eff-71ba-4dca-bbd8-006d9267cea2')/scheduledActionConfigurations",
      "scheduledActionConfigurations": [
        {
          "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
          "@odata.id": "deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/scheduledActionsForRule('6b870eff-71ba-4dca-bbd8-006d9267cea2')/scheduledActionConfigurations('30fea429-3705-4617-a5ca-f423443b41a5')",
          "@odata.editLink": "deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/scheduledActionsForRule('6b870eff-71ba-4dca-bbd8-006d9267cea2')/scheduledActionConfigurations('30fea429-3705-4617-a5ca-f423443b41a5')",
          "id": "30fea429-3705-4617-a5ca-f423443b41a5",
          "gracePeriodHours": 24,
          "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
          "actionType": "block",
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
          "notificationMessageCCList@odata.type": "#Collection(String)",
          "notificationMessageCCList": []
        }
      ]
    }
  ],
  "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/microsoft.graph.androidWorkProfileCompliancePolicy/deviceSettingStateSummaries/$ref",
  "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/microsoft.graph.androidWorkProfileCompliancePolicy/deviceSettingStateSummaries",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/microsoft.graph.androidWorkProfileCompliancePolicy/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/microsoft.graph.androidWorkProfileCompliancePolicy/deviceStatuses",
  "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/microsoft.graph.androidWorkProfileCompliancePolicy/deviceStatusOverview/$ref",
  "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/microsoft.graph.androidWorkProfileCompliancePolicy/deviceStatusOverview",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/microsoft.graph.androidWorkProfileCompliancePolicy/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/microsoft.graph.androidWorkProfileCompliancePolicy/userStatuses",
  "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/microsoft.graph.androidWorkProfileCompliancePolicy/userStatusOverview/$ref",
  "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/microsoft.graph.androidWorkProfileCompliancePolicy/userStatusOverview",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.assign"
  },
  "#microsoft.graph.scheduleActionsForRules": {
    "title": "microsoft.graph.scheduleActionsForRules",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('6b870eff-71ba-4dca-bbd8-006d9267cea2')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.scheduleActionsForRules"
  }
}
