{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
  "@odata.type": "#microsoft.graph.androidWorkProfileGeneralDeviceConfiguration",
  "@odata.id": "deviceManagement/deviceConfigurations('98100628-25f9-4956-82f9-625170e0e6cc')",
  "@odata.editLink": "deviceManagement/deviceConfigurations('98100628-25f9-4956-82f9-625170e0e6cc')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration",
  "id": "98100628-25f9-4956-82f9-625170e0e6cc",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2026-04-27T09:09:59.101096Z",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "supportsScopeTags": true,
  "deviceManagementApplicabilityRuleOsEdition": null,
  "deviceManagementApplicabilityRuleOsVersion": null,
  "deviceManagementApplicabilityRuleDeviceMode": null,
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2026-01-12T13:19:08.4350756Z",
  "description": "Device Restrictions Configuration Policy for Android Enterprise Personally Owned Work Profile (BYOD).",
  "displayName": "AND - DC - Device-Restrictions - USR - Personally-Owned - Work-Profile",
  "version": 36,
  "passwordBlockFaceUnlock": false,
  "passwordBlockFingerprintUnlock": false,
  "passwordBlockIrisUnlock": false,
  "passwordBlockTrustAgents": true,
  "passwordExpirationDays": null,
  "passwordMinimumLength": null,
  "passwordMinutesOfInactivityBeforeScreenTimeout": null,
  "passwordPreviousPasswordBlockCount": null,
  "passwordSignInFailureCountBeforeFactoryReset": null,
  "passwordRequiredType@odata.type": "#microsoft.graph.androidWorkProfileRequiredPasswordType",
  "passwordRequiredType": "deviceDefault",
  "requiredPasswordComplexity@odata.type": "#microsoft.graph.androidRequiredPasswordComplexity",
  "requiredPasswordComplexity": "medium",
  "workProfileAllowAppInstallsFromUnknownSources": false,
  "workProfileDataSharingType@odata.type": "#microsoft.graph.androidWorkProfileCrossProfileDataSharingType",
  "workProfileDataSharingType": "allowPersonalToWork",
  "workProfileBlockNotificationsWhileDeviceLocked": true,
  "workProfileBlockAddingAccounts": true,
  "workProfileBluetoothEnableContactSharing": false,
  "workProfileBlockScreenCapture": true,
  "workProfileBlockCrossProfileCallerId": true,
  "workProfileBlockCamera": false,
  "workProfileBlockCrossProfileContactsSearch": true,
  "workProfileBlockCrossProfileCopyPaste": true,
  "workProfileDefaultAppPermissionPolicy@odata.type": "#microsoft.graph.androidWorkProfileDefaultAppPermissionPolicyType",
  "workProfileDefaultAppPermissionPolicy": "prompt",
  "workProfilePasswordBlockFaceUnlock": false,
  "workProfilePasswordBlockFingerprintUnlock": false,
  "workProfilePasswordBlockIrisUnlock": false,
  "workProfilePasswordBlockTrustAgents": true,
  "workProfilePasswordExpirationDays": 365,
  "workProfilePasswordMinimumLength": 6,
  "workProfilePasswordMinNumericCharacters": null,
  "workProfilePasswordMinNonLetterCharacters": null,
  "workProfilePasswordMinLetterCharacters": null,
  "workProfilePasswordMinLowerCaseCharacters": null,
  "workProfilePasswordMinUpperCaseCharacters": null,
  "workProfilePasswordMinSymbolCharacters": null,
  "workProfilePasswordMinutesOfInactivityBeforeScreenTimeout": 5,
  "workProfilePasswordPreviousPasswordBlockCount": 5,
  "workProfilePasswordSignInFailureCountBeforeFactoryReset": 10,
  "workProfilePasswordRequiredType@odata.type": "#microsoft.graph.androidWorkProfileRequiredPasswordType",
  "workProfilePasswordRequiredType": "numericComplex",
  "workProfileRequiredPasswordComplexity@odata.type": "#microsoft.graph.androidRequiredPasswordComplexity",
  "workProfileRequiredPasswordComplexity": "medium",
  "workProfileRequirePassword": true,
  "securityRequireVerifyApps": true,
  "vpnAlwaysOnPackageIdentifier": "",
  "vpnEnableAlwaysOnLockdownMode": false,
  "workProfileAllowWidgets": false,
  "workProfileBlockPersonalAppInstallsFromUnknownSources": true,
  "workProfileAccountUse@odata.type": "#microsoft.graph.androidWorkProfileAccountUse",
  "workProfileAccountUse": "blockAll",
  "allowedGoogleAccountDomains@odata.type": "#Collection(String)",
  "allowedGoogleAccountDomains": [],
  "blockUnifiedPasswordForWorkProfile": false,
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('98100628-25f9-4956-82f9-625170e0e6cc')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('98100628-25f9-4956-82f9-625170e0e6cc')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('98100628-25f9-4956-82f9-625170e0e6cc')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/assignments",
  "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('98100628-25f9-4956-82f9-625170e0e6cc')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceSettingStateSummaries/$ref",
  "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('98100628-25f9-4956-82f9-625170e0e6cc')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceSettingStateSummaries",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('98100628-25f9-4956-82f9-625170e0e6cc')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('98100628-25f9-4956-82f9-625170e0e6cc')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceStatuses",
  "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('98100628-25f9-4956-82f9-625170e0e6cc')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceStatusOverview/$ref",
  "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('98100628-25f9-4956-82f9-625170e0e6cc')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceStatusOverview",
  "groupAssignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('98100628-25f9-4956-82f9-625170e0e6cc')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/groupAssignments/$ref",
  "groupAssignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('98100628-25f9-4956-82f9-625170e0e6cc')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/groupAssignments",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('98100628-25f9-4956-82f9-625170e0e6cc')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('98100628-25f9-4956-82f9-625170e0e6cc')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/userStatuses",
  "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('98100628-25f9-4956-82f9-625170e0e6cc')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/userStatusOverview/$ref",
  "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('98100628-25f9-4956-82f9-625170e0e6cc')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/userStatusOverview",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('98100628-25f9-4956-82f9-625170e0e6cc')/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
  },
  "#microsoft.graph.assignedAccessMultiModeProfiles": {
    "title": "microsoft.graph.assignedAccessMultiModeProfiles",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('98100628-25f9-4956-82f9-625170e0e6cc')/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
  },
  "#microsoft.graph.windowsPrivacyAccessControls": {
    "title": "microsoft.graph.windowsPrivacyAccessControls",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('98100628-25f9-4956-82f9-625170e0e6cc')/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
  },
  "#microsoft.graph.getOmaSettingPlainTextValue": {
    "title": "microsoft.graph.getOmaSettingPlainTextValue",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('98100628-25f9-4956-82f9-625170e0e6cc')/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
  }
}
