{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/androidManagedAppProtections(assignments(),apps())/$entity",
  "@odata.type": "#microsoft.graph.androidManagedAppProtection",
  "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')",
  "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')",
  "displayName": "AND - App-Protection - USR - MAM - All Microsoft Apps - BYOD",
  "description": "App Protection Policy for Company Apps on Android Unmanaged BYOD Devices. \n\nLevel 1 enterprise basic data protection – Microsoft recommends this configuration as the minimum data protection configuration for an enterprise device.",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-11-27T18:06:51.1329042Z",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2026-04-29T14:01:29Z",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "T_0bf995fe-0369-490f-9398-600f61c236df",
  "version": "\"6c088305-0000-1600-0000-69f20f390000\"",
  "periodOfflineBeforeAccessCheck@odata.type": "#Duration",
  "periodOfflineBeforeAccessCheck": "PT12H",
  "periodOnlineBeforeAccessCheck@odata.type": "#Duration",
  "periodOnlineBeforeAccessCheck": "PT30M",
  "allowedInboundDataTransferSources@odata.type": "#microsoft.graph.managedAppDataTransferLevel",
  "allowedInboundDataTransferSources": "managedApps",
  "allowedOutboundDataTransferDestinations@odata.type": "#microsoft.graph.managedAppDataTransferLevel",
  "allowedOutboundDataTransferDestinations": "managedApps",
  "organizationalCredentialsRequired": true,
  "allowedOutboundClipboardSharingLevel@odata.type": "#microsoft.graph.managedAppClipboardSharingLevel",
  "allowedOutboundClipboardSharingLevel": "managedAppsWithPasteIn",
  "dataBackupBlocked": true,
  "deviceComplianceRequired": true,
  "managedBrowserToOpenLinksRequired": true,
  "saveAsBlocked": true,
  "periodOfflineBeforeWipeIsEnforced@odata.type": "#Duration",
  "periodOfflineBeforeWipeIsEnforced": "P90D",
  "pinRequired": true,
  "maximumPinRetries": 5,
  "simplePinBlocked": true,
  "minimumPinLength": 6,
  "pinCharacterSet@odata.type": "#microsoft.graph.managedAppPinCharacterSet",
  "pinCharacterSet": "numeric",
  "periodBeforePinReset@odata.type": "#Duration",
  "periodBeforePinReset": "P90D",
  "allowedDataStorageLocations@odata.type": "#Collection(microsoft.graph.managedAppDataStorageLocation)",
  "allowedDataStorageLocations": [
    "localStorage",
    "oneDriveForBusiness",
    "sharePoint"
  ],
  "contactSyncBlocked": true,
  "printBlocked": true,
  "fingerprintBlocked": false,
  "disableAppPinIfDevicePinIsSet": false,
  "maximumRequiredOsVersion": null,
  "maximumWarningOsVersion": null,
  "maximumWipeOsVersion": null,
  "minimumRequiredOsVersion": "13.0",
  "minimumWarningOsVersion": null,
  "minimumRequiredAppVersion": null,
  "minimumWarningAppVersion": null,
  "minimumWipeOsVersion": null,
  "minimumWipeAppVersion": null,
  "appActionIfDeviceComplianceRequired@odata.type": "#microsoft.graph.managedAppRemediationAction",
  "appActionIfDeviceComplianceRequired": "block",
  "appActionIfMaximumPinRetriesExceeded@odata.type": "#microsoft.graph.managedAppRemediationAction",
  "appActionIfMaximumPinRetriesExceeded": "block",
  "pinRequiredInsteadOfBiometricTimeout@odata.type": "#Duration",
  "pinRequiredInsteadOfBiometricTimeout": "PT30M",
  "allowedOutboundClipboardSharingExceptionLength": 0,
  "notificationRestriction@odata.type": "#microsoft.graph.managedAppNotificationRestriction",
  "notificationRestriction": "blockOrganizationalData",
  "previousPinBlockCount": 5,
  "managedBrowser@odata.type": "#microsoft.graph.managedBrowserType",
  "managedBrowser": "microsoftEdge",
  "maximumAllowedDeviceThreatLevel@odata.type": "#microsoft.graph.managedAppDeviceThreatLevel",
  "maximumAllowedDeviceThreatLevel": "notConfigured",
  "mobileThreatDefenseRemediationAction@odata.type": "#microsoft.graph.managedAppRemediationAction",
  "mobileThreatDefenseRemediationAction": "block",
  "mobileThreatDefensePartnerPriority": null,
  "blockDataIngestionIntoOrganizationDocuments": true,
  "allowedDataIngestionLocations@odata.type": "#Collection(microsoft.graph.managedAppDataIngestionLocation)",
  "allowedDataIngestionLocations": [
    "oneDriveForBusiness",
    "sharePoint",
    "camera"
  ],
  "appActionIfUnableToAuthenticateUser@odata.type": "#microsoft.graph.managedAppRemediationAction",
  "appActionIfUnableToAuthenticateUser": "block",
  "dialerRestrictionLevel@odata.type": "#microsoft.graph.managedAppPhoneNumberRedirectLevel",
  "dialerRestrictionLevel": "allApps",
  "gracePeriodToBlockAppsDuringOffClockHours": null,
  "protectedMessagingRedirectAppType@odata.type": "#microsoft.graph.messagingRedirectAppType",
  "protectedMessagingRedirectAppType": "anyApp",
  "isAssigned": false,
  "targetedAppManagementLevels@odata.type": "#microsoft.graph.appManagementLevel",
  "targetedAppManagementLevels": "unspecified",
  "appGroupType@odata.type": "#microsoft.graph.targetedManagedAppGroupType",
  "appGroupType": "allCoreMicrosoftApps",
  "screenCaptureBlocked": true,
  "disableAppEncryptionIfDeviceEncryptionIsEnabled": false,
  "encryptAppData": true,
  "deployedAppCount": 12,
  "minimumRequiredPatchVersion": null,
  "minimumWarningPatchVersion": null,
  "minimumWipePatchVersion": null,
  "allowedAndroidDeviceManufacturers": null,
  "appActionIfAndroidDeviceManufacturerNotAllowed@odata.type": "#microsoft.graph.managedAppRemediationAction",
  "appActionIfAndroidDeviceManufacturerNotAllowed": "block",
  "appActionIfAccountIsClockedOut": null,
  "appActionIfSamsungKnoxAttestationRequired": null,
  "requiredAndroidSafetyNetDeviceAttestationType@odata.type": "#microsoft.graph.androidManagedAppSafetyNetDeviceAttestationType",
  "requiredAndroidSafetyNetDeviceAttestationType": "basicIntegrityAndDeviceCertification",
  "appActionIfAndroidSafetyNetDeviceAttestationFailed@odata.type": "#microsoft.graph.managedAppRemediationAction",
  "appActionIfAndroidSafetyNetDeviceAttestationFailed": "block",
  "requiredAndroidSafetyNetAppsVerificationType@odata.type": "#microsoft.graph.androidManagedAppSafetyNetAppsVerificationType",
  "requiredAndroidSafetyNetAppsVerificationType": "none",
  "appActionIfAndroidSafetyNetAppsVerificationFailed@odata.type": "#microsoft.graph.managedAppRemediationAction",
  "appActionIfAndroidSafetyNetAppsVerificationFailed": "block",
  "customBrowserPackageId": "",
  "customBrowserDisplayName": "",
  "minimumRequiredCompanyPortalVersion": null,
  "minimumWarningCompanyPortalVersion": null,
  "minimumWipeCompanyPortalVersion": null,
  "keyboardsRestricted": false,
  "allowedAndroidDeviceModels@odata.type": "#Collection(String)",
  "allowedAndroidDeviceModels": [],
  "appActionIfAndroidDeviceModelNotAllowed@odata.type": "#microsoft.graph.managedAppRemediationAction",
  "appActionIfAndroidDeviceModelNotAllowed": "block",
  "customDialerAppPackageId": "",
  "customDialerAppDisplayName": "",
  "biometricAuthenticationBlocked": false,
  "requiredAndroidSafetyNetEvaluationType@odata.type": "#microsoft.graph.androidManagedAppSafetyNetEvaluationType",
  "requiredAndroidSafetyNetEvaluationType": "basic",
  "blockAfterCompanyPortalUpdateDeferralInDays": 0,
  "warnAfterCompanyPortalUpdateDeferralInDays": 0,
  "wipeAfterCompanyPortalUpdateDeferralInDays": 0,
  "deviceLockRequired": false,
  "appActionIfDeviceLockNotSet@odata.type": "#microsoft.graph.managedAppRemediationAction",
  "appActionIfDeviceLockNotSet": "block",
  "connectToVpnOnLaunch": false,
  "appActionIfDevicePasscodeComplexityLessThanLow@odata.type": "#microsoft.graph.managedAppRemediationAction",
  "appActionIfDevicePasscodeComplexityLessThanLow": "block",
  "appActionIfDevicePasscodeComplexityLessThanMedium": null,
  "appActionIfDevicePasscodeComplexityLessThanHigh": null,
  "requireClass3Biometrics": true,
  "requirePinAfterBiometricChange": true,
  "fingerprintAndBiometricEnabled": null,
  "messagingRedirectAppPackageId": "",
  "messagingRedirectAppDisplayName": "",
  "exemptedAppPackages@odata.type": "#Collection(microsoft.graph.keyValuePair)",
  "exemptedAppPackages": [],
  "approvedKeyboards@odata.type": "#Collection(microsoft.graph.keyValuePair)",
  "approvedKeyboards": [],
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/assignments",
  "assignments": [],
  "apps@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps",
  "apps@odata.associationLink": "https://graph.microsoft.com/beta/deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps/$ref",
  "apps@odata.navigationLink": "https://graph.microsoft.com/beta/deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps",
  "apps": [
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.emmx.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.emmx.android')",
      "id": "com.microsoft.emmx.android",
      "version": "-725393251",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.emmx"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.office.excel.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.office.excel.android')",
      "id": "com.microsoft.office.excel.android",
      "version": "-1789826587",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.excel"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.office.officehubhl.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.office.officehubhl.android')",
      "id": "com.microsoft.office.officehubhl.android",
      "version": "-1175805259",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.officehubhl"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.office.officehubrow.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.office.officehubrow.android')",
      "id": "com.microsoft.office.officehubrow.android",
      "version": "-1861979965",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.officehubrow"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.office.onenote.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.office.onenote.android')",
      "id": "com.microsoft.office.onenote.android",
      "version": "186482170",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.onenote"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.office.outlook.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.office.outlook.android')",
      "id": "com.microsoft.office.outlook.android",
      "version": "1146701235",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.outlook"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.office.powerpoint.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.office.powerpoint.android')",
      "id": "com.microsoft.office.powerpoint.android",
      "version": "1411665537",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.powerpoint"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.office.word.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.office.word.android')",
      "id": "com.microsoft.office.word.android",
      "version": "2122351424",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.word"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.sharepoint.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.sharepoint.android')",
      "id": "com.microsoft.sharepoint.android",
      "version": "84773357",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.sharepoint"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.skydrive.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.skydrive.android')",
      "id": "com.microsoft.skydrive.android",
      "version": "1887770705",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.skydrive"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.teams.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.teams.android')",
      "id": "com.microsoft.teams.android",
      "version": "1900143244",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.teams"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.todos.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/apps('com.microsoft.todos.android')",
      "id": "com.microsoft.todos.android",
      "version": "1697858135",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.todos"
      }
    }
  ],
  "deploymentSummary@odata.associationLink": "https://graph.microsoft.com/beta/deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/deploymentSummary/$ref",
  "deploymentSummary@odata.navigationLink": "https://graph.microsoft.com/beta/deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/deploymentSummary",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/microsoft.graph.targetedManagedAppProtection/microsoft.graph.assign"
  },
  "#microsoft.graph.targetApps": [
    {
      "title": "microsoft.graph.targetApps",
      "target": "https://graph.microsoft.com/beta/deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/microsoft.graph.targetedManagedAppProtection/microsoft.graph.targetApps"
    },
    {
      "title": "microsoft.graph.targetApps",
      "target": "https://graph.microsoft.com/beta/deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/microsoft.graph.managedAppPolicy/microsoft.graph.targetApps"
    },
    {
      "title": "microsoft.graph.targetApps",
      "target": "https://graph.microsoft.com/beta/deviceAppManagement/androidManagedAppProtections('T_0bf995fe-0369-490f-9398-600f61c236df')/microsoft.graph.managedAppProtection/microsoft.graph.targetApps"
    }
  ]
}
